tap "daviderestivo/emacs-head"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "sethrfore/r-srf"
cask "xquartz"
brew "automake"
brew "ccache"
brew "coreutils"
brew "curl"
brew "sethrfore/r-srf/cairo"
brew "pango"
brew "fontforge"
brew "git"
brew "ispell"
brew "jags"
brew "llvm"
brew "mas"
brew "neofetch"
brew "node"
brew "pkg-config"
brew "poppler"
brew "pyenv"
brew "pyenv-virtualenv", args: ["HEAD"]
brew "ripgrep"
brew "stow"
brew "toilet"
brew "tree"
brew "wget"
brew "wine"
brew "zsh"
brew "daviderestivo/emacs-head/emacs-head", args: ["HEAD", "with-cocoa", "with-dbus", "with-jansson", "with-mailutils"]
brew "sethrfore/r-srf/r", args: ["with-cairo", "with-icu4c", "with-java", "with-libtiff", "with-openblas", "with-texinfo"]
cask "font-fira-code"
cask "font-firacode-nerd-font"
cask "font-hack-nerd-font"
cask "font-sourcecodepro-nerd-font"
cask "iterm2"
cask "java"
cask "mactex"
cask "rstudio"
cask "skim"
cask "slack"
cask "spectacle"
cask "spotify"
cask "virtualbox"
mas "1Password 7", id: 1333542190
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Spark", id: 1176895641
